// Дано трехзначное число. 
// Определить является ли четной сумма его цифр. 
// Определить, кратна ли сумма его цифр пяти. 
// Определить является ли произведение его цифр больше 100. 



let number = parseInt(prompt("Введіть тризначне  число: "));
if (number > 999) {
    alert("Ви ввели більше трьох цифр.");
} else if (number < 10) {
    alert("Ви ввели одну цифру");
}

// let number = 123;
let num3 = number % 10;
let num2 = parseInt((number % 100) / 10);
let num1 = parseInt((number % 1000) / 100);


let sum = num1 + num2 + num3;
if (sum % 2 === 0) {
    alert(`Сума цифр цього числа є парною`);
} else {
    alert(`Сума не парна`);
}
if (sum % 5 === 0) {
    alert(`Сума цифр цього числа кратна 5`);
} else {
    alert(`Сума цифр не є кратною 5`);
}
let dobutok = num1 * num2 * num3;
if (dobutok > 100) {
    alert(`Добуток цифр цього числа більше 100`);
} else {
    alert(`Добуток цих цифр менше 100`);
}